src/AccumulationRegisters/РезервыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПрихода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/РезервыТоваров/Ext/ManagerModule.bsl
Функция ПолучитьЗапросПроверки(МассивКонтролей) ЭКСПОРТ
	
	 МассивКонтролей.добавить("РезервыТоваров");
	
	 Возврат  "ВЫБРАТЬ
	          |	РезервыТоваровОстатки.Номенклатура,
	          |	РезервыТоваровОстатки.Склад,
	          |	ЕСТЬNULL(РезервыТоваровОстатки.КоличествоОстаток, 0) - РезервыТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
	          |ИЗ
	          |	РегистрНакопления.РезервыТоваров.Остатки(
	          |			&Период,
	          |			(Номенклатура, Склад) В
	          |				(ВЫБРАТЬ
	          |					РезервыТоваровИзменение.Номенклатура КАК Номенклатура,
	          |					РезервыТоваровИзменение.Склад КАК Склад
	          |				ИЗ
	          |					РезервыТоваровИзменение КАК РезервыТоваровИзменение)) КАК РезервыТоваровОстатки
	          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	          |		ПО РезервыТоваровОстатки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	          |			И РезервыТоваровОстатки.Склад = ТоварыНаСкладахОстатки.Склад
	          |ГДЕ
	          |	ЕСТЬNULL(РезервыТоваровОстатки.КоличествоОстаток, 0) - РезервыТоваровОстатки.КоличествоОстаток < 0";
	 	
КонецФункции


Процедура СообщитьОбОшибке(РезультатЗапроса,Объект,Отказ) ЭКСПОРТ
	
	 ШаблонСообщения = НСтр("ru = 'Номенклатура %Номенклатура% 
	|Обнаружен отрицательный резерв  ""%Склад%"" на %Количество% '");

	
	ПредыдущаяЗапись = Новый Структура;
	ПредыдущаяЗапись.Вставить("Склад", 				Неопределено);
	ПредыдущаяЗапись.Вставить("Номенклатура", 				Неопределено);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл   				
		
		Если ПредыдущаяЗапись.Номенклатура <> Выборка.Номенклатура Или ПредыдущаяЗапись.Склад <> Выборка.Склад
		Тогда
			ЗаполнитьЗначенияСвойств(ПредыдущаяЗапись, Выборка);
		Иначе
			Продолжить;
		КонецЕсли;

		
		
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Номенклатура%",Выборка.Номенклатура);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%", Строка(Выборка.Склад) );		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Строка(-Выборка.КоличествоОстаток));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,Объект,,,Отказ);
	КонецЦикла;
	
КонецПроцедуры
